<template>
    <div class="text-left text-indent">
        <h1 class="text-center">用户服务协议</h1>
        <p>
            本《用户服务协议》（以下称“本协议”）是用户（个人或单一实体，以下或称“您”）接受本公司所提供的服务所使用的法律服务条款。本公司在此特别提醒您认真阅读本协议的全部条款，特别是其中免除或者限制本公司责任的免责声明条款（该等条款通常含有“不负任何责任”、“无义务”等词汇）以及用户须遵守的条款和其它限制用户权利的条款（该等条款通常含有“不得”等词汇），这些条款应在中国法律所允许的范围内最大程度地适用。除非用户接受本协议的全部条款，否则无权安装、复制、访问网站、充值、运行客户端软件或以其它方式使用本公司提供的任何服务内容。</p>
        <h3 class="text-indent-0">一、特别提示</h3>
        <p>
            1、本公司同意按照本协议的规定及其不时发布的操作规则提供基于互联网的相关服务(以下称“网络服务”)，为获得网络服务，您同意本协议的全部条款并按照页面上的提示完成全部的注册程序。
            您在进行注册程序过程中点击“同意”按钮即表示用户完全接受本协议项下的全部条款。这些条款可由本公司随时更新，协议条款一旦发生变动，本公司将会在相关的页面上提示变更内容。
            修改后的协议一旦在页面上公布即有效代替原来的协议。您在使用本公司提供的软件产品之前，应仔细阅读本协议，如不同意本服务协议及或随时对其的修改，请停止使用本公司提供的服务内容。
        </p>
        <p>
            2、特别申明，未成年人应在法定监护人的陪同下审阅和接受本协议。未成年人在使用本公司的服务前，应事先取得父母（监护人）的同意。
            若父母（监护人）希望未成年人（尤其是十岁以下子女）得以使用本服务，必须以法定监护人身份加以判断本服务是否符合于未成年人。
            未成年人用户应当在合理程度内使用本公司提供的服务内容，不得因使用本公司提供的服务内容而影响了日常的学习生活。
            用户理解本公司无义务对本款前述事项进行任何形式的审查和确认。
        </p>
        <h3 class="text-indent-0">二、权属声明</h3>
        <p>1、本公司定义的服务内容包括：文字、软件、声音、相片、录像、图表、版式结构；在广告中的全部内容；电子邮件的全部内容；本公司游戏服务为客户提供的商业信息。所有这些内容均受版权、商标、和其它财产所有权法律的保护。用户只有在获得本公司或相关权利人的书面授权之后才能使用这些内容。</p>
        <p>2、本公司发布的所有软件，包括本公司网络棋牌游戏客户端软件等所有游戏客户端软件均受中华人民共和国版权法保护，用户可以免费下载并使用，但未经本公司许可，用户不得修改本公司游戏的客户端程序；不得制作、传播或使用扰乱正常游戏秩序或有损本公司利益的任何第三方软件。</p>
        <p>3、本公司游戏服务的经营权属于本公司所有，除非与本公司另签协议，用户同意本服务仅供个人且仅于本服务平台范围内非商业性质的使用。用户同时承诺不经本公司书面同意，不得利用本服务进行广告、销售、商业展示等商业性用途。</p>
        <p>4、用户发表于本公司游戏及配套网站的所有内容仅代表用户自己的立场和观点，与本公司无关，由用户本人承担一切法律责任。</p>
        <p>5、用户发表于本公司游戏及配套网站的照片、文字著作权都属于用户本人所有，用户同时应保证该照片及文字无任何著作权属上的纠纷，因侵犯他人著作权导致的纠纷均由用户自行承担。</p>
        <p>6、用户同意将其上传的拥有著作权的照片、文字授予本公司全球性、免许可费、非独家、可完全转授权、及永久有效的使用权利，本公司可以为了展示、散布及推广张贴前述内容之特定目的，将前述内容以使用、复制、修改、改编、出版、翻译、据以创作衍生作品后用于其它增值业务。</p>
        <h3 class="text-indent-0">三、用户的基本义务</h3>
        <p>1、用户承诺以其真实身份注册成为本公司的用户，并保证所提供的个人身份资料信息真实、完整、有效，依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。</p>
        <p>2、用户有义务妥善保管在注册服务时获得的帐号及密码谨防被盗或泄露，并为此帐号及密码登入系统后所开始的一连串行为或活动负责。因密码被盗或泄露造成的全部责任和损失均由用户本人承担，本公司对此概不负责。</p>
        <p>3、若用户发现帐号或密码遭他人非法使用或有异常使用的情形，应立即通知本公司，并提交该帐号为本人所有的有关证明，以便申请该帐号的暂停登录和使用。因此而造成的损失本公司不承担赔偿责任。</p>
        <p>4、本公司根据用户的通知采取措施暂停用户帐号的登录和使用的，本公司应当要求用户提供并核实与其注册身份信息相一致的个人有效身份信息。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，本公司有权拒绝用户的请求。</p>
        <p>5、用他人证件及杜撰虚假证件注册的用户的权益在游戏中将得不到任何保障。对提供虚假证件的用户，本公司有权随时中断或终止向用户提供本协议项下的服务（包括收费服务）而无需对用户或任何第三方承担任何责任。</p>
        <p>6、用户因忘记密码或密码被盗向本公司查询密码时，须提供完全正确的注册信息（包括注册时间、首次登陆游戏时所在城市），否则本公司有权本着为用户保密的原则不予告知。</p>
        <p>7、用户同意若发现任何非法使用用户帐号或利用安全漏洞的情况，立即通告本公司，且须承诺在申请帐号时遵循如下规定：</p>
        <p>（1）用户名和中文昵称的注册及使用须尊重网络道德，遵守中华人民共和国的有关法律法规。</p>
        <p>（2）用户名和中文昵称中不得含有任何威胁、恐吓、漫骂、庸俗、亵渎、色情、淫秽、非法、反动、前后矛盾、攻击性、伤害性、骚扰性、诽谤性、辱骂性的或侵害他人知识产权的文字。不得涉及政治、国家领导人及近音国家领导人，以及任何可能引起法律纠纷的文字。</p>
        <p>8、若用户将帐号与他人于现实生活中进行交易或互易行为而产生的纠纷，本公司概不负责。</p>
        <p>9、用户使用在本公司注册的用户名在本公司中的任何行为需要遵守本公司其他各项服务条款，用户对登录后所持帐号产生的行为依法享有权利和承担责任。</p>
        <p>10、用户连续六个月未使用在本公司注册的帐号或首次使用后三个月内再未使用过其帐号或注册后一个月内从未登陆使用过该帐号，经系统审查后，本公司有权采取措施终止该用户继续使用该帐号或回收该帐号（包括但不限于：清除该帐号的积分、等级、游戏币等信息；删除该帐号的注册信息、角色信息等一切相关信息），且不对因此所导致的任何损失负责。</p>
        <p>11、除用户自行填写的注册资料及用户充值的游戏币外，其它由本公司视相关功能或统计或增强游戏娱乐性之需要而生成的游戏数据，其所有权由本公司享有。</p>
        <p>12、用户在本公司充值后若需发票，可向客服中心申请或在购买点索要。</p>
        <p>13、如果您选择进入游戏房间，视为您已知该等游戏的具体规则，并同意在该游戏房间中使用虚拟游戏币的相关规则。</p>
        <h3 class="text-indent-0">四、用户隐私制度</h3>
        <p>本公司绝对不会修改用户的个人资料，或编辑或透露用户在注册资料中的密码、姓名、地址、电话、身份证号码及保存在本公司中的非公开内容，除非有法律许可要求或本公司在诚信的基础上认为透露这些信息在以下四种情况是必要的：</p>
        <p>1、遵守有关法律规定，遵从合法服务程序。</p>
        <p>2、维护本公司的商标所有权。</p>
        <p>3、在紧急情况下竭力维护用户个人和社会大众的隐私安全。</p>
        <p>4、符合其他相关的要求。</p>
        <h3 class="text-indent-0">五、游戏数据的特别规定</h3>
        <p>1、本公司严禁以下行为：</p>
        <p>（1）发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为；</p>
        <p>（2）利用游戏作弊工具或者外挂、游戏BUG获取非法利益，严重侵犯本公司利益的行为；</p>
        <p>（3）论坛、游戏中传播非法讯息、木马病毒、外挂软件等的行为；</p>
        <p>（4）私下利用游戏经营非法盈利性项目、涉嫌赌博获取非法利益、未通过正规渠道进行充值、恶意扰乱游戏正常秩序和聚众侵占游戏资源的帐号一旦查实也将被系统回收，永久封停，永不启用。</p>
        <p>（5）实施违反本协议和相关规定、管理办法、公告、重要提示，对本公司和其他用户利益造成严重损害的其他行为。</p>
        <p>（6）因游戏中举办的活动结束，相关道具被删除或兑换，用户不得提出索赔等要求，本公司对于活动有最终的解释权。</p>
        <p>（7）用户连续360天没有上线游戏，则自第360天当天的24时起，本公司有权采取措施删除该用户账号在游戏数据库中的任何记录（包括但不限于注册信息，角色信息，等级物品信息等）。</p>
        <p>2、对于违反以上规定的用户，一经发现，本公司将视情节轻重对其采取删除其发表的文章、没收其游戏币、元宝财富、封停其游戏帐号、删除其游戏帐号、乃至屏蔽其计算机的处罚。</p>
        <p>3、如果本公司发现用户帐号数据异常，有权采取相应措施，包括对该异常帐号的冻结、终止，该异常帐号内游戏币、元宝等相关数据的清除，用户不得因此要求本公司做任何补偿。</p>
        <p>4、帐号因多人使用而引发的帐号归属纠纷，本公司概不处理，视情节严重，本公司有权回收帐号，永久封停，永不启用。</p>
        <h3 class="text-indent-0">六、服务的停止和更改</h3>
        <p>1、发生下列情形之一时，本公司有权停止或中断向用户提供的服务：</p>
        <p>（1）用户有发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为；</p>
        <p>（2）用户提供虚假注册身份信息，或实施违反本服务条款的行为；</p>
        <p>（3）游戏中合伙作弊，尚未对其他用户利益造成严重影响的行为；</p>
        <p>（4）发布不道德信息、广告、言论、辱骂骚扰他人，扰乱正常的网络秩序和游戏秩序的行为，以及实施违反本协议和相关规定、管理办法、公告、重要提示，对本公司和其他用户利益造成损害的其他行为；</p>
        <p>（5）对于网络设备进行必要的保养及施工；</p>
        <p>（6）发生突发性的网络设备故障时；</p>
        <p>（7）由于不可抗力因素致使本公司无法提供线上服务；</p>
        <p>（8）由于相关政府机构的要求。</p>
        <p>2、在本服务条款约定的情形下，本公司就停止或更改或终止向用户所提供的服务而可能产生的不便或损害，本公司对用户本人或任何第三人均不负任何损害赔偿责任。</p>
        <p>3、用户应了解并同意，本公司所提供的服务可能因公司本身、其它合作厂商或相关电信业者网络系统软硬件设备的故障、失灵、或因合作方及相关电信工作人员人为操作的疏失而全部或一部分中断、暂时无法使用、迟延或因他人侵入本公司系统篡改或伪造变造资料等，造成服务的停止或中断或用户档案缺失，用户不得要求本公司提供任何的补偿或赔偿。</p>
        <p>4、本公司根据本服务条款取消或停止用户的资格或加以限制，用户不得要求补偿或赔偿。</p>
        <p>5、本公司有权仅根据其判断，单方决定新增、修改、删除、暂停或终止其所提供的全部或部分服务（包括且不限于增加、暂停或终止某个游戏的运营），且无需另行个别通知用户，用户不得因此要求任何补偿或赔偿。</p>
        <p>6、本公司对其服务不保证不出现任何程序BUG，并对由此可能产生的问题不承担任何赔偿责任。</p>
        <h3 class="text-indent-0">七、用户违规处罚办法</h3>
        <p>用户违规行为指的是用户违反本公司用户服务条款、本公司论坛服务条款、本公司作弊处罚条款等本公司任何服务条款或管理制度的行为，对于用户违规行为的处罚办法如下：</p>
        <p>1、用户如有违反本公司用户服务条款的行为，本公司有权视情节轻重对其采取删除其发表的文章、没收其游戏币、元宝财富、封闭其游戏帐号、删除其游戏帐号、乃至屏蔽其计算机的处罚，用户不得因此要求本公司做任何补偿或退费。</p>
        <p>2、用户如有作弊行为，将被依据“作弊处罚条例”的规定予以相应的处罚。</p>
        <p>3、用户如有违反本公司论坛服务条款的行为，将被依据“论坛服务条款”的规定予以相应的处罚。</p>
        <p>4、用户如有违反本公司其他服务条款和管理制度的行为，将被依据相关规定予以相应的处罚。本公司各服务条款或管理制度之间不相抵，可各自执行。</p>
        <p>5、未经本公司书面同意，用户以任何营利性、非营利性或损害本公司利益的目的实施以下几种行为的，本公司保留追究上述未经许可行为一切法律责任的权利，给本公司造成经济或名誉上损失的，本公司有权根据相关法律法规另行要求赔偿，情节严重涉嫌犯罪的，本公司将提交司法机关追究刑事责任：</p>
        <p>（1）进行编译、反编译等方式破解本公司游戏软件作品的行为；</p>
        <p>（2）利用技术手段破坏软件系统或者服务器的行为；</p>
        <p>（3）利用游戏外挂、作弊软件、系统漏洞侵犯本公司利益的行为；</p>
        <p>（4）对游戏进行截屏、录像或利用游戏中数据、图片、截屏进行发表的行为；</p>
        <p>（5）制作游戏线下衍生品的行为；</p>
        <p>（6）利用本公司提供的服务内容进行赌博等违法犯罪的行为；</p>
        <p>（7）其他严重侵犯本公司知识产权的行为。</p>
        <h3 class="text-indent-0">八、服务条款的修改</h3>
        <p>本公司保留随时修改本服务条款的权利，修改本服务条款时，本公司将于相关网站公告修改的事实，而不另对用户进行个别通知。若用户不同意修改的内容，可停止使用本公司的服务。若用户继续使用本公司的服务，即视为用户已接受本公司所修订的内容。</p>
        <h3 class="text-indent-0">九、法律适用和争议解决</h3>
        <p>本协议的订立、效力、解释、履行和争议的解决均适用中华人民共和国法律。因本协议所产生的以及因履行本协议而产生的任何争议，双方均应本着友好协商的原则加以解决。协商解决未果，任何一方有权向法院提请审理。</p>

        <br>
        <br>
        <br>
        <br>

        <p class="text-center">上海伦之信息科技有限公司</p>
    </div>
</template>

<script>
    export default {
        name: "Agreement"
    }
</script>

<style scoped>

</style>